{
  "topics": [
    {
      "id": "topic-1",
      "title": "The Bear Bryant Method: 5 Psychological Tricks of a Legendary Coach",
      "description": "Dive into the mind of Bear Bryant, one of football's greatest coaches. This video explores the psychological tactics and leadership principles he used to build dynasties and motivate generations of players, turning athletes into legends.",
      "source": "google-trends",
      "trendScore": 95,
      "category": "psychology",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-2",
      "title": "The Redemption Arc: How Public Figures Navigate Cancel Culture",
      "description": "From public outrage to a career comeback, what does it take to survive being 'canceled'? We analyze the modern phenomenon of cancel culture and the psychology of public forgiveness, using recent examples like Shane Gillis as a case study.",
      "source": "google-trends",
      "trendScore": 92,
      "category": "psychology",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-3",
      "title": "How Sci-Fi Epics Like 'Dune' Engineer Our Future",
      "description": "Explore how visionary films starring actors like Josh Brolin don't just entertain us—they actively shape our real-world technology and societal ambitions. From futuristic interfaces to political ideologies, we break down the powerful cultural impact of science fiction.",
      "source": "google-trends",
      "trendScore": 90,
      "category": "culture",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-4",
      "title": "Anatomy of a Hit Song: Deconstructing the Producer's Playbook",
      "description": "Ever wonder what makes a song a chart-topping hit? We pull back the curtain on the creative process of super-producers like Danny Wolf, exploring the technology, musical theory, and marketing genius that turns a simple beat into a global anthem.",
      "source": "google-trends",
      "trendScore": 88,
      "category": "how-to",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-5",
      "title": "The 'Comfort TV' Epidemic: The Psychology of Why We Crave Familiar Stories",
      "description": "Why are predictable, feel-good movies and shows more popular than ever? This video dives into the psychology behind our need for 'comfort content,' exploring how these narratives, often starring actors like Kristoffer Polaha, reduce anxiety in a chaotic world.",
      "source": "google-trends",
      "trendScore": 85,
      "category": "psychology",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-6",
      "title": "The Science of the Unbreakable Athlete: More Than Just Genes?",
      "description": "Some athletes, like the famously durable Kevon Looney, seem almost indestructible. We investigate the science of athletic durability, from elite training regimens and diet to the psychological fortitude required to play hundreds of games without major injury.",
      "source": "google-trends",
      "trendScore": 82,
      "category": "science",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-7",
      "title": "The Athlete-Entrepreneur: How Women Are Changing the Business of Entertainment",
      "description": "The game has changed. Female athletes are no longer just competitors; they are founders and media moguls. Using trailblazers like Nikki Bella as a framework, we explore the rise of the female athlete-entrepreneur and its cultural impact.",
      "source": "google-trends",
      "trendScore": 80,
      "category": "culture",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-8",
      "title": "The Brand of You: How Gen Z Athletes Are Building Media Empires",
      "description": "For athletes like LaMelo Ball, the court is just one part of their career. We break down the playbook for how young stars are leveraging social media, fashion, and personal branding to build powerful, independent media empires beyond their sport.",
      "source": "google-trends",
      "trendScore": 78,
      "category": "culture",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-9",
      "title": "Beyond the Mask: The Global Explosion of Lucha Libre",
      "description": "From Mexico to the world stage, Lucha Libre is more than just wrestling—it's a vibrant cultural tradition. We trace the history and artistry of this unique phenomenon, looking at international stars like Stephanie Vaquer who are bringing its style to a new generation.",
      "source": "google-trends",
      "trendScore": 75,
      "category": "history",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    },
    {
      "id": "topic-10",
      "title": "The Unsolvable Physics of the Knuckle Puck in Hockey",
      "description": "It baffles goalies and physicists alike. The 'knuckle puck' is one of the most unpredictable shots in sports. We dive into the aerodynamics and physics behind this chaotic phenomenon to explain why it's so effective and difficult to master.",
      "source": "google-trends",
      "trendScore": 70,
      "category": "science",
      "discoveredAt": "2025-11-30T02:10:06.335Z"
    }
  ],
  "discoveredAt": "2025-11-30T02:10:06.335Z",
  "totalCount": 10
}