{
  "topics": [
    {
      "id": "topic-1",
      "title": "Unveiling St. Andrew's Day: Scotland's Patron Saint and National Traditions",
      "description": "Explore the rich history behind Scotland's national day. Discover the legends of Saint Andrew, the ancient traditions, and the modern celebrations that define Scottish culture today.",
      "source": "google-trends",
      "trendScore": 85,
      "category": "History",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-2",
      "title": "The Art of Narration: Liev Schreiber's Impact on Documentary Storytelling",
      "description": "Dive into the craft of voice-over and documentary narration. Analyze how Liev Schreiber's distinctive voice and delivery elevate cinematic storytelling and create unforgettable auditory experiences.",
      "source": "google-trends",
      "trendScore": 75,
      "category": "Culture",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-3",
      "title": "Decoding DTE: The Future of Dynamic Technology Evolution",
      "description": "Explore the paradigm shift in technology with Dynamic Technology Evolution (DTE). This video unpacks what DTE means for innovation, AI, and the future of digital systems.",
      "source": "google-trends",
      "trendScore": 70,
      "category": "Technology",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-4",
      "title": "Seattle's Secret Climate: The Science of Microclimates Explained",
      "description": "Beyond rain: unravel the scientific reasons behind Seattle's unique weather. Discover how urban landscapes and geography create distinct microclimates across the city.",
      "source": "google-trends",
      "trendScore": 65,
      "category": "Science",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-5",
      "title": "The Rise of Maya Jama: A Cultural Phenomenon in British Media",
      "description": "Analyze the career trajectory of Maya Jama and her significant influence on modern media. Explore how she has become a prominent cultural figure and trendsetter.",
      "source": "google-trends",
      "trendScore": 60,
      "category": "Culture",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-6",
      "title": "Beyond the Fairway: Fuzzy Zoeller's Enduring Legacy in Golf History",
      "description": "Remember Fuzzy Zoeller not just for news, but for his indelible mark on golf. This video explores his career highlights, impact on the sport, and lasting influence.",
      "source": "google-trends",
      "trendScore": 60,
      "category": "History",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-7",
      "title": "Mastering the Striker's Art: Alexander Isak's Technique Explained",
      "description": "Dissect the anatomy of a perfect goal with Alexander Isak's technique. Learn the biomechanics, precision, and strategic decision-making that define elite goal-scoring.",
      "source": "google-trends",
      "trendScore": 55,
      "category": "How-to",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-8",
      "title": "The Tactical Science of Elite Defense: How Saliba Dominates the Pitch",
      "description": "Go beyond the score to understand elite football defense. Analyze the tactical intelligence, positioning, and scientific principles behind Saliba's game-changing defensive plays and interceptions.",
      "source": "google-trends",
      "trendScore": 50,
      "category": "Science",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-9",
      "title": "The Physics of the Perfect Shot: Unpacking Seth Curry's Elite Shooting",
      "description": "Explore the physics behind a flawless jump shot. We break down Seth Curry's technique, from release angle to force, illustrating key principles of projectile motion and sports science.",
      "source": "google-trends",
      "trendScore": 50,
      "category": "Science",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    },
    {
      "id": "topic-10",
      "title": "The Psychological Toll: Navigating Fame as a Child Actor",
      "description": "Explore the complex psychological journey of former child stars. This video examines the pressures, coping mechanisms, and long-term effects of early fame.",
      "source": "google-trends",
      "trendScore": 50,
      "category": "Psychology",
      "discoveredAt": "2025-11-30T15:50:36.716Z"
    }
  ],
  "discoveredAt": "2025-11-30T15:50:36.716Z",
  "totalCount": 10
}