{
  "topics": [
    {
      "id": "topic-1",
      "title": "Master Your Mind: The Psychology of Everyday Decisions",
      "description": "Ever wonder why you make certain choices? This video dives into the cognitive biases and psychological principles that influence our decisions, helping you understand yourself and make better choices. Learn how to spot common mental shortcuts and overcome them.",
      "source": "google-trends",
      "trendScore": 95,
      "category": "Psychology",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-2",
      "title": "AI Will Create Your Next Viral Video: The Future of Content",
      "description": "Explore how artificial intelligence is revolutionizing YouTube, filmmaking, and digital media. We'll look at AI tools for scriptwriting, video editing, image generation, and what this means for creators and audiences. Discover the cutting edge of AI-powered creativity.",
      "source": "google-trends",
      "trendScore": 92,
      "category": "Technology",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-3",
      "title": "Learn Anything 10x Faster: The Ultimate Skill Acquisition Guide",
      "description": "Unlock your potential by mastering new skills efficiently. This video breaks down proven learning strategies, from memory techniques to deliberate practice, that can help you master programming, a new language, or any complex subject. Stop struggling and start learning effectively.",
      "source": "google-trends",
      "trendScore": 90,
      "category": "How-to",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-4",
      "title": "Are You Being Fooled? 5 Cognitive Biases That Control Your Thinking",
      "description": "Uncover the hidden mental shortcuts that shape your perception and judgment. This video explains common cognitive biases like confirmation bias and availability heuristic, showing how they affect your opinions and actions. Learn to recognize these biases in yourself and others to think more critically.",
      "source": "google-trends",
      "trendScore": 88,
      "category": "Psychology",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-5",
      "title": "Unlock Peak Performance: The Science of Sleep You Need to Know",
      "description": "Discover the vital role sleep plays in your physical and mental health, productivity, and overall well-being. This video breaks down sleep cycles, the impact of sleep deprivation, and actionable strategies to improve your sleep quality. Wake up energized and sharper than ever.",
      "source": "google-trends",
      "trendScore": 87,
      "category": "Science",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-6",
      "title": "From Sputnik to Mars: The Epic History of Space Exploration",
      "description": "Journey through humanity's quest to conquer the cosmos. This video explores the key milestones, rivalries, and innovations that defined space exploration, from the dawn of the space race to modern missions. Understand the drive and discoveries that pushed us beyond Earth.",
      "source": "google-trends",
      "trendScore": 85,
      "category": "History",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-7",
      "title": "Time is Relative: How Cultures Perceive and Use Time Differently",
      "description": "Explore the fascinating concept of monochronic versus polychronic time and how it shapes daily life, business, and relationships across the globe. Understand why punctuality, scheduling, and 'wasting time' mean different things everywhere. Broaden your cultural understanding.",
      "source": "google-trends",
      "trendScore": 83,
      "category": "Culture",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-8",
      "title": "Memes: How Internet Culture Changed Communication Forever",
      "description": "Dive into the origin, evolution, and profound cultural impact of internet memes. This video examines how memes have become a dominant form of modern communication, influencing language, humor, and social commentary. See how these digital artifacts shape our collective consciousness.",
      "source": "google-trends",
      "trendScore": 80,
      "category": "Culture",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-9",
      "title": "Blockchain Explained: It's Not Just Bitcoin Anymore",
      "description": "Go beyond the hype to understand the foundational technology of blockchain. This video explains how distributed ledgers work and their potential applications in supply chain management, voting systems, digital identity, and more. See the future of secure digital transactions.",
      "source": "google-trends",
      "trendScore": 78,
      "category": "Technology",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    },
    {
      "id": "topic-10",
      "title": "The 3-Step Habit Formula: Build Habits That Stick",
      "description": "Transform your life by understanding the science behind habit formation. This video unpacks the habit loop (cue, routine, reward) and provides practical strategies to build positive habits and break negative ones. Make lasting changes with scientific insights.",
      "source": "google-trends",
      "trendScore": 75,
      "category": "How-to",
      "discoveredAt": "2025-11-30T16:02:20.707Z"
    }
  ],
  "discoveredAt": "2025-11-30T16:02:20.707Z",
  "totalCount": 10
}