{
  "topics": [
    {
      "id": "topic-1",
      "title": "Rockstar Games: The Controversial Kings of Open-World Gaming",
      "description": "From Grand Theft Auto to Red Dead Redemption, we explore the history of Rockstar Games, the revolutionary technology behind their titles, and the cultural impact and controversies they've sparked.",
      "source": "google-trends",
      "trendScore": 95,
      "category": "technology",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-2",
      "title": "How Algorithms Secretly Run Your Life",
      "description": "Ever wonder why you see certain ads or video recommendations? This video breaks down the complex science of algorithms, explaining how they decide what you see online and influence your daily decisions.",
      "source": "google-trends",
      "trendScore": 92,
      "category": "technology",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-3",
      "title": "The Invisible Waves That Power Our World",
      "description": "Explore the unseen science of waves. From the Wi-Fi and cell signals that connect us to the sound waves we hear, this video makes the physics of invisible energy simple, fascinating, and visual.",
      "source": "google-trends",
      "trendScore": 88,
      "category": "science",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-4",
      "title": "The Insane Technology Keeping You Alive in a Modern Hospital",
      "description": "Go behind the scenes of a modern medical marvel. We'll explore the incredible technology—from robotic surgery to AI diagnostics—that makes today's hospitals titans of science and engineering.",
      "source": "google-trends",
      "trendScore": 85,
      "category": "technology",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-5",
      "title": "The Terrifying History of Hospitals (You'll Be Glad You Live in the 21st Century)",
      "description": "Before modern medicine, hospitals were places of horror. This video uncovers the shocking and gruesome history of early medical institutions, revealing how far we've truly come.",
      "source": "google-trends",
      "trendScore": 82,
      "category": "history",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-6",
      "title": "The Psychology of a 'Rockstar' Programmer: Myth vs. Reality",
      "description": "What makes a '10x engineer' tick? We dive into the psychology of elite coders, exploring the mindset, habits, and pressures that come with being a 'rockstar' in the tech world.",
      "source": "google-trends",
      "trendScore": 79,
      "category": "psychology",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-7",
      "title": "How Giant Ocean Waves Are Formed (And Why They're Getting Bigger)",
      "description": "From monster rogue waves to the rhythmic tides, we dive deep into the science of how ocean waves are generated. We'll also explore the alarming connection between climate change and the increasing power of our seas.",
      "source": "google-trends",
      "trendScore": 77,
      "category": "science",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-8",
      "title": "The Psychology of a Hospital Stay: Why Time Slows Down and Anxiety Spikes",
      "description": "Why does a day in the hospital feel like a week? We explore the unique psychological effects of being a patient, from altered time perception to heightened anxiety, and what you can do to cope.",
      "source": "google-trends",
      "trendScore": 75,
      "category": "psychology",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-9",
      "title": "How to Think Like a Rockstar: Applying Creative Genius to Your Career",
      "description": "You don't need a guitar to have the mindset of a rockstar. This video breaks down the psychological traits of legendary performers—confidence, creativity, and resilience—and shows you how to apply them to your own life and career.",
      "source": "google-trends",
      "trendScore": 72,
      "category": "how-to",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    },
    {
      "id": "topic-10",
      "title": "Building a Modern Empire: The Business Strategy of Rockstar Games",
      "description": "How did Rockstar become a multi-billion dollar giant? This video analyzes their business model, marketing genius, and unapologetic focus on quality over quantity to reveal lessons any entrepreneur can learn.",
      "source": "google-trends",
      "trendScore": 70,
      "category": "other",
      "discoveredAt": "2025-11-25T08:21:22.995Z"
    }
  ],
  "discoveredAt": "2025-11-25T08:21:22.995Z",
  "totalCount": 10
}