{
  "topics": [
    {
      "id": "topic-1",
      "title": "The Devotion Brain: The Science of Why We Worship Sports Teams",
      "description": "Why do we feel ecstatic when a team like the Pelicans or Warriors wins and devastated when they lose? This video dives into the neuroscience and psychology of sports fandom, exploring tribal identity, mirror neurons, and the dopamine rush that keeps us hooked on the game.",
      "source": "google-trends",
      "trendScore": 95,
      "category": "psychology",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-2",
      "title": "The Psychology of Clutch: What Happens in an Athlete's Brain During High-Pressure Moments",
      "description": "Why do some athletes thrive under pressure while others choke? This video explores the psychology of 'clutch' performance, diving into concepts like flow state, focus, anxiety management, and the mental training top athletes use to succeed when everything is on the line.",
      "source": "google-trends",
      "trendScore": 93,
      "category": "psychology",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-3",
      "title": "More Than a Game: The Million-Dollar Tech Behind an NBA Match",
      "description": "Go behind the scenes of a major NBA game like Pelicans vs. Warriors. This video breaks down the incredible technology used for broadcasting, player tracking, and fan experience. We'll explore everything from the high-tech cameras to the data analytics that shape the game.",
      "source": "google-trends",
      "trendScore": 92,
      "category": "technology",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-4",
      "title": "How K-Pop Conquered the World: The LISA Effect",
      "description": "Lisa from Blackpink is a global icon, but her rise is part of a much larger cultural phenomenon. This video explores the 'Hallyu' or Korean Wave, breaking down the business strategies, social media dominance, and cultural diplomacy that made K-Pop a global force.",
      "source": "google-trends",
      "trendScore": 90,
      "category": "culture",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-5",
      "title": "The Moneyball Myth: How Data REALLY Transformed Sports",
      "description": "You've heard of Moneyball, but the data revolution in sports goes much deeper. We'll explain the advanced analytics used today, from player-tracking in basketball to performance metrics in football, and show how data scientists have become the new superstars of the sports world.",
      "source": "google-trends",
      "trendScore": 89,
      "category": "technology",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-6",
      "title": "The Secret Psychology of Pro Wrestling: How WWE Creates Superstars",
      "description": "This video explores the fascinating world of professional wrestling, not as a sport, but as a unique form of storytelling. We'll break down the character archetypes, narrative structures, and psychological tricks WWE uses to captivate millions, using the rise of stars like Lash Legend as a case study.",
      "source": "google-trends",
      "trendScore": 88,
      "category": "culture",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-7",
      "title": "The Rise, Fall, and Rebirth of Fake Sports: A Pro Wrestling History",
      "description": "Before the WWE, pro wrestling was a scattered, regional spectacle. This documentary-style video explores the wild history of professional wrestling, from its carnival roots to the territorial wars, the rise of Vince McMahon, and its modern-day corporate dominance.",
      "source": "google-trends",
      "trendScore": 86,
      "category": "history",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-8",
      "title": "The Student-Athlete Machine: The Multi-Billion Dollar Reality of College Football",
      "description": "Programs like USF Football generate millions, but what is the real experience for players like Ty Simpson or Deuce Knight? This video investigates the intense pressures, financial complexities, and the debate over player compensation in modern college sports.",
      "source": "google-trends",
      "trendScore": 85,
      "category": "culture",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-9",
      "title": "How to Go Viral: The Marketing Secrets of Major Sports Leagues",
      "description": "The NBA and NFL aren't just sports organizations; they're content machines. This video is a how-to guide on modern marketing, deconstructing how these leagues use social media, storytelling, and celebrity athletes to build massive global brands.",
      "source": "google-trends",
      "trendScore": 84,
      "category": "how-to",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    },
    {
      "id": "topic-10",
      "title": "The Global NBA: Pascal Siakam's Unlikely Journey from Cameroon to Champion",
      "description": "The NBA is filled with international stars. Using Pascal Siakam's incredible story as a centerpiece, we explore how basketball has become a global sport, the scouting networks that find talent in unexpected places, and the cultural impact of international players in America.",
      "source": "google-trends",
      "trendScore": 82,
      "category": "culture",
      "discoveredAt": "2025-11-30T01:11:24.145Z"
    }
  ],
  "discoveredAt": "2025-11-30T01:11:24.145Z",
  "totalCount": 10
}